In [173]:
import pandas as pd

data = pd.read_csv('../Original Data/15_ZACHODNIOPOMORSKIE.csv')
data

,Unnamed: 0,Dni od zakupu,Marka,Wiek kupującego,Płeć kupującego,Ocena
0,0,6,Tefal,43.0,K,2.5
1,1,9,Electrolux,35.0,bd.,3.5
2,2,3,Beko,40.0,bd.,3.5
3,3,3,Tefal,37.0,bd.,1.5
4,4,8,Tefal,34.0,K,2.5
...,...,...,...,...,...,...
520,520,7,Tefal,36.0,bd.,3.0
521,521,12,Beko,35.0,K,3.5
522,522,9,Electrolux,18.0,K,3.0
523,523,7,Samsung,32.0,K,2.0
524,524,10,Samsung,20.0,K,2.0

In [174]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525 entries, 0 to 524
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       525 non-null    int64
 1   Dni od zakupu    525 non-null    int64
 2   Marka            525 non-null    object
 3   Wiek kupującego  467 non-null    float64
 4   Płeć kupującego  525 non-null    object
 5   Ocena            525 non-null    float64
dtypes: float64(2), int64(2), object(2)
memory usage: 24.7+ KB

In [175]:
data.describe()

       Unnamed: 0  Dni od zakupu  Wiek kupującego       Ocena
count  525.000000     525.000000       467.000000  525.000000
mean   262.000000       6.998095        40.265525    2.332381
std    151.698715       2.761167         9.338539    1.092348
min      0.000000       1.000000        18.000000    0.000000
25%    131.000000       5.000000        34.000000    1.500000
50%    262.000000       7.000000        40.000000    2.500000
75%    393.000000       9.000000        47.000000    3.000000
max    524.000000      16.000000        76.000000    5.000000

In [176]:
data.pop('Unnamed: 0')

bins = [0, 25, 35, 45, 55, 65, 120]
labels = ['18-25', '26-35', '36-45', '46-55', '56-65', '66+']
data['Wiek kupującego'] = pd.cut(data['Wiek kupującego'], bins=bins, labels=labels, right=False)

data = data.dropna(axis=0)
data = data[data['Płeć kupującego'] != 'bd.']

data.to_csv('../Analysis Data/data.csv')
data

     Dni od zakupu       Marka Wiek kupującego Płeć kupującego  Ocena
0                6       Tefal           36-45               K    2.5
4                8       Tefal           26-35               K    2.5
5                9     Samsung           46-55               K    2.0
6               13        Beko           56-65               M    2.0
7                8  Electrolux           26-35               K    2.5
..             ...         ...             ...             ...    ...
519              6  Electrolux           46-55               K    2.0
521             12        Beko           36-45               K    3.5
522              9  Electrolux           18-25               K    3.0
523              7     Samsung           26-35               K    2.0
524             10     Samsung           18-25               K    2.0

[389 rows x 5 columns]